{
  "basics": {
    "name": "Alejandro Beltrán Coronado",
    "label": "Software Engineer",
    "picture": "https://en.gravatar.com/userimage/20121596/f715988b87014cd3a525a460f9621551.jpg?size=200",
    "email": "alebelcor@gmail.com",
    "summary": "Motivated and focused professional that is constantly searching for excellence through expansion of current knowledge and delivery of high quality work.",
    "location": {
      "city": "Hermosillo",
      "countryCode": "MX",
      "region": "Sonora"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "github.com/alebelcor",
        "url": "https://github.com/alebelcor"
      },
      {
        "network": "LinkedIn",
        "username": "linkedin.com/in/alebelcor",
        "url": "https://linkedin.com/in/alebelcor"
      }
    ]
  },
  "projects": [
    {
      "name": "Effective a11y",
      "description": "🤝 Hands-on Web accessibility",
      "keywords": [
        "Accessibility",
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "url": "https://github.com/alebelcor/effective-a11y",
      "type": "Personal"
    },
    {
      "name": "React Property List",
      "description": "🏠 Property list/detail showcase web app written in React/React Hooks/Reach Router/Emotion",
      "keywords": [
        "React",
        "React Hooks",
        "Reach Router",
        "Emotion"
      ],
      "url": "https://github.com/alebelcor/react-property-list",
      "type": "Personal"
    },
    {
      "name": "React Resume Editor",
      "description": "💼 Resume editor web app written in React/Apollo/GraphQL/Prisma",
      "keywords": [
        "React",
        "Apollo",
        "GraphQL",
        "Prisma"
      ],
      "url": "https://github.com/alebelcor/react-resume-editor",
      "type": "Personal"
    },
    {
      "name": "React Tic-tac-toe",
      "description": "⭕️❌❌ Tic-tac-toe written in React and Redux",
      "keywords": [
        "React",
        "Redux"
      ],
      "url": "https://github.com/alebelcor/react-tic-tac-toe/",
      "type": "Personal"
    },
    {
      "name": "Many more on GitHub!",
      "description": "Feel free to take a look",
      "url": "https://github.com/alebelcor?tab=repositories&type=source",
      "type": "Personal"
    }
  ],
  "work": [
    {
      "company": "AmericanTours International, LLC (via Nearsoft)",
      "position": "Software Engineer",
      "website": "https://americantours.com",
      "startDate": "2019-11-01",
      "summary": "Focused on Front End Engineering, designing and building, from scratch, an internal administration tool for payment review and processing using React.<br><br>Tech: JavaScript, HTML, CSS, Sass (SCSS), Node.js, React, React Bootstrap, React Router, Reselect, Jest, React Testing Library, Create React App, PropTypes, ESLint, Prettier, Husky, Yarn, date-fns, Visual Studio Code, SVN with git-svn"
    },
    {
      "company": "Switchfly, LLC (via Nearsoft)",
      "position": "Software Engineer",
      "website": "https://switchfly.com",
      "startDate": "2014-02-01",
      "endDate": "2019-08-01",
      "summary": "Focused on Front End Engineering and maintenance of a SaaS platform that powers travel, loyalty, social, payment, and mobile products for multiple clients. <br><br> Tech: JavaScript, Java, HTML, CSS, Sass (SCSS), Ember.js, Handlebars.js, Git, Gulp, JSHint, Karma, Mocha, Chai, npm, jQuery, Selenium, Jenkins, Ant, Maven, IntelliJ IDEA"
    },
    {
      "company": "Evolve Media, LLC (via Intugo, an Offshore Group Company)",
      "position": "Senior Software Engineer",
      "website": "https://evolvemediallc.com",
      "startDate": "2013-07-01",
      "endDate": "2014-02-01",
      "summary": "Worked as Senior Software Engineer focused on Front End Engineering for multiple heavily trafficked and highly ranked websites targeting, among other things: women, fashion, sports, gaming and entertainment. <br><br> Tech: JavaScript, PHP, WordPress, HTML, CSS with Sass (SCSS), Compass, and Susy, jQuery, SVN with git-svn, Jenkins, Ant, npm, Grunt, JSHint, Capistrano"
    },
    {
      "company": "Evolve Media, LLC (via Intugo, an Offshore Group Company)",
      "position": "Software Engineer",
      "website": "https://evolvemediallc.com",
      "startDate": "2012-07-01",
      "endDate": "2013-07-01",
      "summary": "Worked as Software Engineer focused on Front End Engineering for multiple heavily trafficked and highly ranked websites targeting, among other things: women, fashion, sports, gaming and entertainment. <br><br> Tech: JavaScript, PHP, WordPress, HTML, CSS with Sass (SCSS), Compass, and Susy, jQuery, SVN with git-svn, Jenkins, Ant, npm, Grunt, JSHint, Capistrano"
    },
    {
      "company": "OptumInsight (via Nearsoft)",
      "position": "Application Development Engineer",
      "startDate": "2009-01-01",
      "endDate": "2012-06-01",
      "summary": "Worked as Application Development Engineer extending and maintaining their EMR Lite system, related services and applications. <br><br> Tech: Java, Java EE, Servlets, JavaScript, LotusScript, Formula Language, Lotus Notes, Lotus Domino, Tomcat, HTML, CSS, XML, XPath, XSLT, SVN, CVS, RCS, Maven, Ant, Make, Jenkins"
    }
  ],
  "education": [
    {
      "institution": "Instituto Tecnológico de Hermosillo",
      "area": "Computer Systems Engineering",
      "studyType": "Bachelor",
      "startDate": "2004-08-01",
      "endDate": "2008-12-01"
    }
  ],
  "skills": [
    {
      "name": "Software Engineering",
      "level": "Advanced",
      "keywords": [
        "Agile Software Development",
        "Software Release Cycle",
        "Unit Testing",
        "Integration Testing",
        "End-to-end Testing",
        "Continuous Integration",
        "Software Security",
        "Static Code Analysis"
      ]
    },
    {
      "name": "Front End (Web)",
      "level": "Advanced",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript",
        "Web Performance",
        "Web Accessibility",
        "React",
        "React Hooks",
        "Redux",
        "CSS-in-JS",
        "Ember.js",
        "Handlebars.js",
        "jQuery",
        "Sass"
      ]
    },
    {
      "name": "Tools",
      "level": "Advanced",
      "keywords": [
        "Node.js",
        "npm",
        "Yarn",
        "ESLint",
        "Prettier",
        "XO",
        "AVA",
        "Chai",
        "Jasmine",
        "Mocha",
        "Jest",
        "Karma",
        "Grunt",
        "Gulp",
        "PostCSS",
        "Git",
        "Bash",
        "Zsh",
        "Homebrew",
        "Homebrew Cask",
        "Markdown",
        "VS Code",
        "IntelliJ IDEA"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    }
  ],
  "references": [
    {
      "name": "Darrin Yun, Lead Product Manager at Switchfly, LLC. (2019) <a target=\"_blank\" href=\"https://www.linkedin.com/in/darrinkyun\">https://www.linkedin.com/in/darrinkyun</a>",
      "reference": "Alejandro, you've been a great leader that has consistently delivered and provided critical insights on how our platform should be built. Your vision to make our platform more scalable, more modern, and efficient has brought Switchfly out of the stone ages and into the 21st century. Even though we still have a long ways to improve, your attention to detail and work ethics have built an inspiring foundation for which to build on. You faced challenges head-on when assigned to poorly defined features, you focused on results when menial tasks had to be completed, and you always carried the spirit of the team with your humor/attitude. As an example: even though the platform team didn’t get pre-approval to upgrade UI component libraries, you delve into all 200 hours of POCs to give us the justification to make an informed and confident decision. That speaks volumes to your dedication, focus, and foresight…enforcing your status as a role model for others on the team. You have been a \"core\" part of our Core platform team. Any company or team would be extremely blessed to have you, your skills, and amazing attitude."
    },
    {
      "name": "Sally Ma, QA Manager at Switchfly, LLC. (2019) <a target=\"_blank\" href=\"https://www.linkedin.com/in/sally-m-9871391/\">https://www.linkedin.com/in/sally-m-9871391</a>",
      "reference": "Alejandro is one of the best developers I have had the pleasure working with. Alejandro is a technical lead with a very creative and curious mind, who delivers high quality work in a timely manner. His curiosity drives him to asking great and challenging questions. His creativity enables him to always able to find a way to resolve even the most challenging problem. He often times is able to suggest alternative that others may not have thought of. Alejandro is a frequent contributor at refinement meeting, and is never afraid to speak up and asking questions. Alejandro is also a great communicator and very patient. Every time when I needed his help or explanation on any of his implementation, I was never disappointed. He will go above and beyond in helping his teammates. Alejandro is very thorough and detail oriented. He always provides RCA and detailed explanations in his fixes for issues. These are invaluable information in helping QA to do thorough testing. Bonus point is that he also has a great sense of humor. Alejandro will bring great value to any team that is so lucky to have him!"
    },
    {
      "name": "Annie Liang, Senior Web Designer at Switchfly, LLC. (2019) <a target=\"_blank\" href=\"https://www.linkedin.com/in/annieliang/\">https://www.linkedin.com/in/annieliang</a>",
      "reference": "I have always enjoyed working with Alejandro. He is extremely talented in all areas of Web development and have always been a very valuable member of our team. He is a problem solver; always finding creative solutions to solve the most complex problems. He is extremely detail oriented, always raises questions on issues that others may not have considered, and always delivers on time. Not only does he have a strong technical background, he’s an excellent communicator and overall a fun colleague to work with. Any team is lucky to have him."
    },
    {
      "name": "Glen Chen, Senior Product Manager at Switchfly, LLC. (2019) <a target=\"_blank\" href=\"https://www.linkedin.com/in/glenchen/\">https://www.linkedin.com/in/glenchen</a>",
      "reference": "As a Product Manager, I worked closely with Alejandro on the same team for close to 2 years. Alejandro is not only technically strong, but he also took the initiative to provide helpful feedback and look into new ways to accomplish challenging tasks. Whenever we had a big new feature with many unknowns, we could trust Alejandro to do the initial research, proof of concept, and final implementation. He had a big hand in integrating a new calendar, dropdown form, and filter sliders into our app. The results were beautiful and modern. In addition, Alejandro has excellent communication skills and is an active participant during planning meetings. He is clear, concise, and helpful with his feedback. It was a real pleasure working with him and having him as part of the team!"
    },
    {
      "name": "James Lee, former Staff Web Developer at Switchfly, LLC. (2019) <a target=\"_blank\" href=\"https://www.linkedin.com/in/jgplee/\">https://www.linkedin.com/in/jgplee</a>",
      "reference": "Alejandro and I worked together as colleagues in Front End Engineering projects, and he is overall a very strong technical lead. Naturally a very curious and detailed oriented person, he often finds and discover new tech-related articles and ideas to keep the team thinking out of the box. As I spent a lot of time doing project-level non-technical tasks, I can always depend on Alejandro as my right-hand man to be able to execute and achieve very high-quality work on our projects, as well as on platform improvement work and proof-of-concepts. He is highly experienced and knowledgeable in many areas of Front End Engineering such as, JavaScript, build tools, semantic/usability markup, styling, accessibility, front end patterns and web-app performance. I have learned so much from him over the past few years working together, and it was very motivating to work with him. Aside from technical skills, Alejandro also has strong communication skills you'd find in a leader. He keeps an open mind that specs are not always perfect, and is not afraid to speak up during any time of the SDLC. He knows that things don't end just because you're done coding. In addition to being a Native Spanish speaker, Alejandro has Native-level English skills in reading and writing. All his verbal and written communication is very detail oriented. With his calm and patient demeanor, he is pleasant to work with, and is very dependable and accountable. With strong technical and communication skills, Alejandro is definitely someone I would like on my team, and is someone that you will definitely learn and grow together with."
    },
    {
      "name": "Ivan Rodic, Staff Engineer at Switchfly, LLC. (2019) <a target=\"_blank\" href=\"https://www.linkedin.com/in/ivan-rodic-31214710/\">https://www.linkedin.com/in/ivan-rodic-31214710</a>",
      "reference": "It is a great pleasure to work with Alejandro. He always delivers what promised, when promised. Alejandro is the Subject Matter Expert in JavaScript/Ember.js. His expertise proved valuable in many occasions. He is a valuable resource, always ready to help others."
    },
    {
      "name": "Jose Miguel Salcido Aguilar, former Software Engineer at Switchfly, LLC. (2019) <a target=\"_blank\" href=\"https://www.linkedin.com/in/jmsalcido/\">https://www.linkedin.com/in/jmsalcido</a>",
      "reference": "Very good communication skills that is compromised to deliver quality to the stakeholders, this makes him a very strong team member to work with. One of the best engineers of the team which I was part and a very dedicated engineer that puts all the effort to deliver a clean and elegant solution even if the codebase or project is a pain to work on, a very methodic person that annotates and creates a very important set of notes used to deliver a finished product given a requirement."
    },
    {
      "name": "Miriam Romero Gross, former Growth Product Manager at Switchfly, LLC. (2018) <a target=\"_blank\" href=\"https://www.linkedin.com/in/miriamngross/\">https://www.linkedin.com/in/miriamngross</a>",
      "reference": "Alejandro was a pleasure to work with. He helped us to launch one of our most proactive initiatives, our growth and performance team, and I couldn't have asked for a better partner. He brought thoughtful ideas for improving our functionality, helped to mentor other engineers on the team, and was always incredibly patient and helpful when I needed something technical explained. Because we were working in a new area, there was often some ambiguity, but Alejandro worked through it with me and often pointed out alternatives I had missed. Any product manager would be lucky to work with Alejandro and any engineering team would benefit from his approach."
    },
    {
      "name": "Ya-Wen Hsu, former Engineering Manager at Switchfly, LLC. (2017) <a target=\"_blank\" href=\"https://www.linkedin.com/in/yawenhsu365/\">https://www.linkedin.com/in/yawenhsu365</a>",
      "reference": "I'm lucky to have Alejandro on my team as he exceeded my expectations on many levels. He's very strong technically. His curiosity helps him to get a better context and ask great questions with a great attitude. He's very patient and detail-oriented when given unclear/challenging tasks. He's reliable in delivering work in a timely manner with high quality. He has become an essential part of our team's success within a year since he's joined the team. I highly recommend Alejandro's work!"
    },
    {
      "name": "Swarup Bandyopadhyay, former Engineering Manager at Switchfly, LLC. (2016) <a target=\"_blank\" href=\"https://www.linkedin.com/in/sbandy/\">https://www.linkedin.com/in/sbandy</a>",
      "reference": "Alejandro is a great combination of both excellent technical prowess along w/ superb communication skills. I have managed Alejandro for 2 years and I know when I give him an assignment, it will be done on time and with high quality. He excels at raising issues and finding solutions and recommendations for a variety of issues. I would strongly recommend Alejandro and would jump at the chance to work with him again."
    },
    {
      "name": "Amanda Chiu, former Project Manager at Switchfly, LLC. (2016) <a target=\"_blank\" href=\"https://www.linkedin.com/in/amandachiu/\">https://www.linkedin.com/in/amandachiu</a>",
      "reference": "Not only is Alejandro sharp and quick to put together clean solutions, but he also possesses clear communication skills that make him a strong team member to work with. He was one of the best developers I had the pleasure of working with at Switchfly, and a fantastic example of how a creative, fast-paced, and forward thinking web developer could majorly help steer the success of a team."
    },
    {
      "name": "Basile Kuo, former Engineering Manager at Switchfly, LLC. (2015) <a target=\"_blank\" href=\"https://www.linkedin.com/in/basilekuo/\">https://www.linkedin.com/in/basilekuo</a>",
      "reference": "It wasn't long before Alejandro joined our team and became one of the leading front end developers. He is an expert in his domain as a web developer, but his ability reaches well beyond it. Alejandro is adept at solutioning, resolving issues the right way quickly. In addition to his technical strength, Alejandro communicates well and keeps his team laughing with his keen sense of humor. Who wouldn't want him on their team? Come back to mine!"
    },
    {
      "name": "Vinoj Zacharia, former Director Software Engineering at Evolve Media, LLC. (2015) <a target=\"_blank\" href=\"https://www.linkedin.com/in/vinoj/\">https://www.linkedin.com/in/vinoj</a>",
      "reference": "Alejandro was easily one of the best developers I've collaborated with. He innately has a clear grasp of how to take business requirements and convert it to code, and it helped greatly that he was a front-end code aficionado, constantly keeping up with the best techniques and practices. I believe Alejandro will be successful at any organization, both with his technical savvy and his amicable personality."
    },
    {
      "name": "Katie Bolz, former Product Manager at Evolve Media, LLC. (2014) <a target=\"_blank\" href=\"https://www.linkedin.com/in/katiebolz/\">https://www.linkedin.com/in/katiebolz</a>",
      "reference": "I had the pleasure of working with Alejandro when he was a Senior Software Engineer at Evolve Media LLC. While offering smart solutions and support daily, he managed to repeatedly crank out high quality results. In addition to bringing expertise, he also is a very easy to talk to makes an excellent team member. I would highly recommend Alejandro, he is an exceptional asset and any team would be lucky to have him."
    },
    {
      "name": "Janet Park, former Product Manager at Evolve Media, LLC. (2013) <a target=\"_blank\" href=\"https://www.linkedin.com/in/park-janet/\">https://www.linkedin.com/in/park-janet</a>",
      "reference": "Alejandro is the kind of guy you want playing for your team. He's collaborative, focused, and excels at creative problem solving. Brain-storming with him is always exciting adventure. Every time I've approached him with a problem, we've always emerged from the conversation with an elegant solution that's both sexy and simple. I admire the passion he has for his craft, and his dedication to staying current on emerging trends. He's an excellent communicator, a good friend, and an absolute joy to work with day after day."
    },
    {
      "name": "Thiago Croce, former Software Engineering Manager at Axolotl Corp. (2011) <a target=\"_blank\" href=\"https://www.linkedin.com/in/thiagofousekcroce/\">https://www.linkedin.com/in/thiagofousekcroce</a>",
      "reference": "Alejandro is an extremely devoted engineer, willing to go far beyond the expected to deliver quality code. He has become not only a dependable and knowledgeable part of our team, but has also become a resident expert in several web technologies, such as JavaScript, HTML, and DOM."
    },
    {
      "name": "Daren Nicholson, former Product Manager at Axolotl Corp. (2011) <a target=\"_blank\" href=\"https://www.linkedin.com/in/daren/\">https://www.linkedin.com/in/daren</a>",
      "reference": "Alejandro does excellent work. He always finds ways to solve problems and often catches details that others overlook. His communication skills are excellent. It's always a joy to watch when he demonstrates new functionality that he has built."
    },
    {
      "name": "Lin Wan, former Director of Software Development at Axolotl Corp. (2011) <a target=\"_blank\" href=\"https://www.linkedin.com/in/lin-wan-9996ba3/\">https://www.linkedin.com/in/lin-wan-9996ba3</a>",
      "reference": "Alejandro has worked conscientiously on projects assigned to him and has picked up significant domain and software development knowledge over the years."
    }
  ]
}
